Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/adchs.h
#define ADCHS_ADCSYSCFG0INV_Msk               _UINT32_(0x00000000)                                 /* (ADCHS_ADCSYSCFG0INV) Register Mask  */


/* -------- ADCHS_ADCDATA0 : (ADCHS Offset: 0xA00) ( R/ 32)  -------- */
#define ADCHS_ADCDATA0_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA0)   Reset Value */

#define ADCHS_ADCDATA0_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA0)  Position */
#define ADCHS_ADCDATA0_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA0_DATA_Pos)    /* (ADCHS_ADCDATA0)  Mask */
#define ADCHS_ADCDATA0_DATA(value)            (ADCHS_ADCDATA0_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA0_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA0 register */
#define ADCHS_ADCDATA0_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA0) Register Mask  */


/* -------- ADCHS_ADCDATA1 : (ADCHS Offset: 0xA10) ( R/ 32)  -------- */
#define ADCHS_ADCDATA1_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA1)   Reset Value */

#define ADCHS_ADCDATA1_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA1)  Position */
#define ADCHS_ADCDATA1_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA1_DATA_Pos)    /* (ADCHS_ADCDATA1)  Mask */
#define ADCHS_ADCDATA1_DATA(value)            (ADCHS_ADCDATA1_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA1_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA1 register */
#define ADCHS_ADCDATA1_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA1) Register Mask  */


/* -------- ADCHS_ADCDATA2 : (ADCHS Offset: 0xA20) ( R/ 32)  -------- */
#define ADCHS_ADCDATA2_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA2)   Reset Value */

#define ADCHS_ADCDATA2_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA2)  Position */
#define ADCHS_ADCDATA2_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA2_DATA_Pos)    /* (ADCHS_ADCDATA2)  Mask */
#define ADCHS_ADCDATA2_DATA(value)            (ADCHS_ADCDATA2_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA2_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA2 register */
#define ADCHS_ADCDATA2_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA2) Register Mask  */


/* -------- ADCHS_ADCDATA3 : (ADCHS Offset: 0xA30) ( R/ 32)  -------- */
#define ADCHS_ADCDATA3_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA3)   Reset Value */

#define ADCHS_ADCDATA3_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA3)  Position */
#define ADCHS_ADCDATA3_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA3_DATA_Pos)    /* (ADCHS_ADCDATA3)  Mask */
#define ADCHS_ADCDATA3_DATA(value)            (ADCHS_ADCDATA3_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA3_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA3 register */
#define ADCHS_ADCDATA3_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA3) Register Mask  */


/* -------- ADCHS_ADCDATA4 : (ADCHS Offset: 0xA40) ( R/ 32)  -------- */
#define ADCHS_ADCDATA4_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA4)   Reset Value */

#define ADCHS_ADCDATA4_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA4)  Position */
#define ADCHS_ADCDATA4_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA4_DATA_Pos)    /* (ADCHS_ADCDATA4)  Mask */
#define ADCHS_ADCDATA4_DATA(value)            (ADCHS_ADCDATA4_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA4_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA4 register */
#define ADCHS_ADCDATA4_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA4) Register Mask  */


/* -------- ADCHS_ADCDATA5 : (ADCHS Offset: 0xA50) ( R/ 32)  -------- */
#define ADCHS_ADCDATA5_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA5)   Reset Value */

#define ADCHS_ADCDATA5_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA5)  Position */
#define ADCHS_ADCDATA5_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA5_DATA_Pos)    /* (ADCHS_ADCDATA5)  Mask */
#define ADCHS_ADCDATA5_DATA(value)            (ADCHS_ADCDATA5_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA5_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA5 register */
#define ADCHS_ADCDATA5_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA5) Register Mask  */


/* -------- ADCHS_ADCDATA6 : (ADCHS Offset: 0xA60) ( R/ 32)  -------- */
#define ADCHS_ADCDATA6_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA6)   Reset Value */

#define ADCHS_ADCDATA6_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA6)  Position */
#define ADCHS_ADCDATA6_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA6_DATA_Pos)    /* (ADCHS_ADCDATA6)  Mask */
#define ADCHS_ADCDATA6_DATA(value)            (ADCHS_ADCDATA6_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA6_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA6 register */
#define ADCHS_ADCDATA6_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA6) Register Mask  */


/* -------- ADCHS_ADCDATA7 : (ADCHS Offset: 0xA70) (R/W 32)  -------- */
#define ADCHS_ADCDATA7_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA7)   Reset Value */

#define ADCHS_ADCDATA7_DATA_Pos               _UINT32_(0)                                          /* (ADCHS_ADCDATA7)  Position */
#define ADCHS_ADCDATA7_DATA_Msk               (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA7_DATA_Pos)    /* (ADCHS_ADCDATA7)  Mask */
#define ADCHS_ADCDATA7_DATA(value)            (ADCHS_ADCDATA7_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA7_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA7 register */
#define ADCHS_ADCDATA7_Msk                    _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA7) Register Mask  */


/* -------- ADCHS_ADCDATA8 : (ADCHS Offset: 0xA80) ( R/ 32)  -------- */
#define ADCHS_ADCDATA8_RESETVALUE             _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA8)   Reset Value */

