Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/adchs.h
/* -------- ADCHS_ADCDATA17 : (ADCHS Offset: 0xB10) ( R/ 32)  -------- */
#define ADCHS_ADCDATA17_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA17)   Reset Value */

#define ADCHS_ADCDATA17_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA17)  Position */
#define ADCHS_ADCDATA17_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA17_DATA_Pos)   /* (ADCHS_ADCDATA17)  Mask */
#define ADCHS_ADCDATA17_DATA(value)           (ADCHS_ADCDATA17_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA17_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA17 register */
#define ADCHS_ADCDATA17_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA17) Register Mask  */


/* -------- ADCHS_ADCDATA18 : (ADCHS Offset: 0xB20) ( R/ 32)  -------- */
#define ADCHS_ADCDATA18_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA18)   Reset Value */

#define ADCHS_ADCDATA18_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA18)  Position */
#define ADCHS_ADCDATA18_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA18_DATA_Pos)   /* (ADCHS_ADCDATA18)  Mask */
#define ADCHS_ADCDATA18_DATA(value)           (ADCHS_ADCDATA18_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA18_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA18 register */
#define ADCHS_ADCDATA18_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA18) Register Mask  */


/* -------- ADCHS_ADCDATA19 : (ADCHS Offset: 0xB30) ( R/ 32)  -------- */
#define ADCHS_ADCDATA19_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA19)   Reset Value */

#define ADCHS_ADCDATA19_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA19)  Position */
#define ADCHS_ADCDATA19_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA19_DATA_Pos)   /* (ADCHS_ADCDATA19)  Mask */
#define ADCHS_ADCDATA19_DATA(value)           (ADCHS_ADCDATA19_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA19_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA19 register */
#define ADCHS_ADCDATA19_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA19) Register Mask  */


/* -------- ADCHS_ADCDATA20 : (ADCHS Offset: 0xB40) ( R/ 32)  -------- */
#define ADCHS_ADCDATA20_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA20)   Reset Value */

#define ADCHS_ADCDATA20_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA20)  Position */
#define ADCHS_ADCDATA20_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA20_DATA_Pos)   /* (ADCHS_ADCDATA20)  Mask */
#define ADCHS_ADCDATA20_DATA(value)           (ADCHS_ADCDATA20_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA20_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA20 register */
#define ADCHS_ADCDATA20_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA20) Register Mask  */


/* -------- ADCHS_ADCDATA21 : (ADCHS Offset: 0xB50) ( R/ 32)  -------- */
#define ADCHS_ADCDATA21_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA21)   Reset Value */

#define ADCHS_ADCDATA21_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA21)  Position */
#define ADCHS_ADCDATA21_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA21_DATA_Pos)   /* (ADCHS_ADCDATA21)  Mask */
#define ADCHS_ADCDATA21_DATA(value)           (ADCHS_ADCDATA21_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA21_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA21 register */
#define ADCHS_ADCDATA21_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA21) Register Mask  */


/* -------- ADCHS_ADCDATA22 : (ADCHS Offset: 0xB60) ( R/ 32)  -------- */
#define ADCHS_ADCDATA22_RESETVALUE            _UINT32_(0x00)                                       /*  (ADCHS_ADCDATA22)   Reset Value */

#define ADCHS_ADCDATA22_DATA_Pos              _UINT32_(0)                                          /* (ADCHS_ADCDATA22)  Position */
#define ADCHS_ADCDATA22_DATA_Msk              (_UINT32_(0xFFFFFFFF) << ADCHS_ADCDATA22_DATA_Pos)   /* (ADCHS_ADCDATA22)  Mask */
#define ADCHS_ADCDATA22_DATA(value)           (ADCHS_ADCDATA22_DATA_Msk & (_UINT32_(value) << ADCHS_ADCDATA22_DATA_Pos)) /* Assigment of value for DATA in the ADCHS_ADCDATA22 register */
#define ADCHS_ADCDATA22_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (ADCHS_ADCDATA22) Register Mask  */


/** \brief ADCHS register offsets definitions */
#define ADCHS_ADCCON1_REG_OFST         _UINT32_(0x00)      /* (ADCHS_ADCCON1)  Offset */
#define ADCHS_ADCCON1CLR_REG_OFST      _UINT32_(0x04)      /* (ADCHS_ADCCON1CLR) Bit clear register Offset */
#define ADCHS_ADCCON1SET_REG_OFST      _UINT32_(0x08)      /* (ADCHS_ADCCON1SET) Bit set register Offset */
#define ADCHS_ADCCON1INV_REG_OFST      _UINT32_(0x0C)      /* (ADCHS_ADCCON1INV) Bit invert register Offset */
#define ADCHS_ADCCON2_REG_OFST         _UINT32_(0x10)      /* (ADCHS_ADCCON2)  Offset */
#define ADCHS_ADCCON2CLR_REG_OFST      _UINT32_(0x14)      /* (ADCHS_ADCCON2CLR) Bit clear register Offset */
#define ADCHS_ADCCON2SET_REG_OFST      _UINT32_(0x18)      /* (ADCHS_ADCCON2SET) Bit set register Offset */
#define ADCHS_ADCCON2INV_REG_OFST      _UINT32_(0x1C)      /* (ADCHS_ADCCON2INV) Bit invert register Offset */
#define ADCHS_ADCCON3_REG_OFST         _UINT32_(0x20)      /* (ADCHS_ADCCON3)  Offset */
#define ADCHS_ADCCON3CLR_REG_OFST      _UINT32_(0x24)      /* (ADCHS_ADCCON3CLR) Bit clear register Offset */
#define ADCHS_ADCCON3SET_REG_OFST      _UINT32_(0x28)      /* (ADCHS_ADCCON3SET) Bit set register Offset */
#define ADCHS_ADCCON3INV_REG_OFST      _UINT32_(0x2C)      /* (ADCHS_ADCCON3INV) Bit invert register Offset */
#define ADCHS_ADCTRGMODE_REG_OFST      _UINT32_(0x30)      /* (ADCHS_ADCTRGMODE) ADC Triggering Mode for Dedicated ADC Register Offset */
#define ADCHS_ADCIMCON1_REG_OFST       _UINT32_(0x40)      /* (ADCHS_ADCIMCON1)  Offset */
#define ADCHS_ADCIMOD1CLR_REG_OFST     _UINT32_(0x44)      /* (ADCHS_ADCIMOD1CLR) Bit clear register Offset */
#define ADCHS_ADCIMOD1SET_REG_OFST     _UINT32_(0x48)      /* (ADCHS_ADCIMOD1SET) Bit set register Offset */
#define ADCHS_ADCIMOD1INV_REG_OFST     _UINT32_(0x4C)      /* (ADCHS_ADCIMOD1INV) Bit invert register Offset */
#define ADCHS_ADCIMCON2_REG_OFST       _UINT32_(0x50)      /* (ADCHS_ADCIMCON2)  Offset */
#define ADCHS_ADCGIRQEN1_REG_OFST      _UINT32_(0x80)      /* (ADCHS_ADCGIRQEN1)  Offset */
#define ADCHS_ADCGIRQEN1CLR_REG_OFST   _UINT32_(0x84)      /* (ADCHS_ADCGIRQEN1CLR) Bit clear register Offset */
#define ADCHS_ADCGIRQEN1SET_REG_OFST   _UINT32_(0x88)      /* (ADCHS_ADCGIRQEN1SET) Bit set register Offset */
#define ADCHS_ADCGIRQEN1INV_REG_OFST   _UINT32_(0x8C)      /* (ADCHS_ADCGIRQEN1INV) Bit invert register Offset */
#define ADCHS_ADCCSS1_REG_OFST         _UINT32_(0xA0)      /* (ADCHS_ADCCSS1)  Offset */
#define ADCHS_ADCCSS1CLR_REG_OFST      _UINT32_(0xA4)      /* (ADCHS_ADCCSS1CLR) Bit clear register Offset */
#define ADCHS_ADCCSS1SET_REG_OFST      _UINT32_(0xA8)      /* (ADCHS_ADCCSS1SET) Bit set register Offset */
#define ADCHS_ADCCSS1INV_REG_OFST      _UINT32_(0xAC)      /* (ADCHS_ADCCSS1INV) Bit invert register Offset */
#define ADCHS_ADCDSTAT1_REG_OFST       _UINT32_(0xC0)      /* (ADCHS_ADCDSTAT1)  Offset */
#define ADCHS_ADCDSTAT1CLR_REG_OFST    _UINT32_(0xC4)      /* (ADCHS_ADCDSTAT1CLR) Bit clear register Offset */
#define ADCHS_ADCDSTAT1SET_REG_OFST    _UINT32_(0xC8)      /* (ADCHS_ADCDSTAT1SET) Bit set register Offset */
#define ADCHS_ADCDSTAT1INV_REG_OFST    _UINT32_(0xCC)      /* (ADCHS_ADCDSTAT1INV) Bit invert register Offset */
#define ADCHS_ADCCMPEN1_REG_OFST       _UINT32_(0xE0)      /* (ADCHS_ADCCMPEN1)  Offset */
#define ADCHS_ADCCMPEN0CLR_REG_OFST    _UINT32_(0xE4)      /* (ADCHS_ADCCMPEN0CLR) Bit clear register Offset */
#define ADCHS_ADCCMPEN0SET_REG_OFST    _UINT32_(0xE8)      /* (ADCHS_ADCCMPEN0SET) Bit set register Offset */
#define ADCHS_ADCCMPEN0INV_REG_OFST    _UINT32_(0xEC)      /* (ADCHS_ADCCMPEN0INV) Bit invert register Offset */
#define ADCHS_ADCCMP1_REG_OFST         _UINT32_(0xF0)      /* (ADCHS_ADCCMP1)  Offset */
#define ADCHS_ADCCMP0CLR_REG_OFST      _UINT32_(0xF4)      /* (ADCHS_ADCCMP0CLR) Bit clear register Offset */
#define ADCHS_ADCCMP0SET_REG_OFST      _UINT32_(0xF8)      /* (ADCHS_ADCCMP0SET) Bit set register Offset */
#define ADCHS_ADCCMP0INV_REG_OFST      _UINT32_(0xFC)      /* (ADCHS_ADCCMP0INV) Bit invert register Offset */
#define ADCHS_ADCCMPEN2_REG_OFST       _UINT32_(0x100)     /* (ADCHS_ADCCMPEN2)  Offset */
#define ADCHS_ADCCMPEN1CLR_REG_OFST    _UINT32_(0x104)     /* (ADCHS_ADCCMPEN1CLR) Bit clear register Offset */
#define ADCHS_ADCCMPEN1SET_REG_OFST    _UINT32_(0x108)     /* (ADCHS_ADCCMPEN1SET) Bit set register Offset */
#define ADCHS_ADCCMPEN1INV_REG_OFST    _UINT32_(0x10C)     /* (ADCHS_ADCCMPEN1INV) Bit invert register Offset */
#define ADCHS_ADCCMP2_REG_OFST         _UINT32_(0x110)     /* (ADCHS_ADCCMP2)  Offset */
#define ADCHS_ADDCMP1CLR_REG_OFST      _UINT32_(0x114)     /* (ADCHS_ADDCMP1CLR) Bit clear register Offset */
#define ADCHS_ADDCMP1SET_REG_OFST      _UINT32_(0x118)     /* (ADCHS_ADDCMP1SET) Bit set register Offset */
#define ADCHS_ADDCMP1INV_REG_OFST      _UINT32_(0x11C)     /* (ADCHS_ADDCMP1INV) Bit invert register Offset */
#define ADCHS_ADCFLTR1_REG_OFST        _UINT32_(0x1A0)     /* (ADCHS_ADCFLTR1)  Offset */
#define ADCHS_ADCFLTR0CLR_REG_OFST     _UINT32_(0x1A4)     /* (ADCHS_ADCFLTR0CLR) Bit clear register Offset */
#define ADCHS_ADCFLTR0SET_REG_OFST     _UINT32_(0x1A8)     /* (ADCHS_ADCFLTR0SET) Bit set register Offset */
#define ADCHS_ADCFLTR0INV_REG_OFST     _UINT32_(0x1AC)     /* (ADCHS_ADCFLTR0INV) Bit invert register Offset */
#define ADCHS_ADCFLTR2_REG_OFST        _UINT32_(0x1B0)     /* (ADCHS_ADCFLTR2)  Offset */
#define ADCHS_ADCFLTR1CLR_REG_OFST     _UINT32_(0x1B4)     /* (ADCHS_ADCFLTR1CLR) Bit clear register Offset */
#define ADCHS_ADCFLTR1SET_REG_OFST     _UINT32_(0x1B8)     /* (ADCHS_ADCFLTR1SET) Bit set register Offset */
#define ADCHS_ADCFLTR1INV_REG_OFST     _UINT32_(0x1BC)     /* (ADCHS_ADCFLTR1INV) Bit invert register Offset */
#define ADCHS_ADCTRG1_REG_OFST         _UINT32_(0x200)     /* (ADCHS_ADCTRG1) ADC Trigger Source 1 Register Offset */
#define ADCHS_ADCTRG1CLR_REG_OFST      _UINT32_(0x204)     /* (ADCHS_ADCTRG1CLR) Bit clear register Offset */
#define ADCHS_ADCTRG1SET_REG_OFST      _UINT32_(0x208)     /* (ADCHS_ADCTRG1SET) Bit set register Offset */
#define ADCHS_ADCTRG1INV_REG_OFST      _UINT32_(0x20C)     /* (ADCHS_ADCTRG1INV) Bit invert register Offset */
#define ADCHS_ADCTRG2_REG_OFST         _UINT32_(0x210)     /* (ADCHS_ADCTRG2) ADC Trigger Source 2 Register Offset */
#define ADCHS_ADTRG2CLR_REG_OFST       _UINT32_(0x214)     /* (ADCHS_ADTRG2CLR) Bit clear register Offset */
#define ADCHS_ADTRG2SET_REG_OFST       _UINT32_(0x218)     /* (ADCHS_ADTRG2SET) Bit set register Offset */
#define ADCHS_ADTRG2INV_REG_OFST       _UINT32_(0x21C)     /* (ADCHS_ADTRG2INV) Bit invert register Offset */
#define ADCHS_ADTRG3CLR_REG_OFST       _UINT32_(0x224)     /* (ADCHS_ADTRG3CLR) Bit clear register Offset */
#define ADCHS_ADTRG3SET_REG_OFST       _UINT32_(0x228)     /* (ADCHS_ADTRG3SET) Bit set register Offset */
#define ADCHS_ADTRG3INV_REG_OFST       _UINT32_(0x22C)     /* (ADCHS_ADTRG3INV) Bit invert register Offset */
#define ADCHS_ADCCMPCON1_REG_OFST      _UINT32_(0x280)     /* (ADCHS_ADCCMPCON1)  Offset */
#define ADCHS_ADCCMPCON1CLR_REG_OFST   _UINT32_(0x284)     /* (ADCHS_ADCCMPCON1CLR) Bit clear register Offset */
#define ADCHS_ADCCMPCON1SET_REG_OFST   _UINT32_(0x288)     /* (ADCHS_ADCCMPCON1SET) Bit set register Offset */
#define ADCHS_ADCCMPCON1INV_REG_OFST   _UINT32_(0x28C)     /* (ADCHS_ADCCMPCON1INV) Bit invert register Offset */
#define ADCHS_ADCCMPCON2_REG_OFST      _UINT32_(0x290)     /* (ADCHS_ADCCMPCON2)  Offset */
#define ADCHS_ADCMPCON2CLR_REG_OFST    _UINT32_(0x294)     /* (ADCHS_ADCMPCON2CLR) Bit clear register Offset */
#define ADCHS_ADCMPCON2SET_REG_OFST    _UINT32_(0x298)     /* (ADCHS_ADCMPCON2SET) Bit set register Offset */
#define ADCHS_ADCMPCON2INV_REG_OFST    _UINT32_(0x29C)     /* (ADCHS_ADCMPCON2INV) Bit invert register Offset */
#define ADCHS_ADCFSTATCLR_REG_OFST     _UINT32_(0x2E4)     /* (ADCHS_ADCFSTATCLR) Bit clear register Offset */
#define ADCHS_ADCFSTATSET_REG_OFST     _UINT32_(0x2E8)     /* (ADCHS_ADCFSTATSET) Bit set register Offset */
#define ADCHS_ADCFSTATINV_REG_OFST     _UINT32_(0x2EC)     /* (ADCHS_ADCFSTATINV) Bit invert register Offset */
#define ADCHS_ADCFIFOCLR_REG_OFST      _UINT32_(0x2F4)     /* (ADCHS_ADCFIFOCLR) Bit clear register Offset */
#define ADCHS_ADCFIFOSET_REG_OFST      _UINT32_(0x2F8)     /* (ADCHS_ADCFIFOSET) Bit set register Offset */
#define ADCHS_ADCFIFOINV_REG_OFST      _UINT32_(0x2FC)     /* (ADCHS_ADCFIFOINV) Bit invert register Offset */
#define ADCHS_ADCBASE_REG_OFST         _UINT32_(0x300)     /* (ADCHS_ADCBASE)  Offset */
#define ADCHS_ADCBASECLR_REG_OFST      _UINT32_(0x304)     /* (ADCHS_ADCBASECLR) Bit clear register Offset */
#define ADCHS_ADCBASESET_REG_OFST      _UINT32_(0x308)     /* (ADCHS_ADCBASESET) Bit set register Offset */
#define ADCHS_ADCBASEINV_REG_OFST      _UINT32_(0x30C)     /* (ADCHS_ADCBASEINV) Bit invert register Offset */
#define ADCHS_ADCDMASTAT_REG_OFST      _UINT32_(0x310)     /* (ADCHS_ADCDMASTAT)  Offset */
#define ADCHS_ADCDMASTATCLR_REG_OFST   _UINT32_(0x314)     /* (ADCHS_ADCDMASTATCLR) Bit clear register Offset */
#define ADCHS_ADCDMASTATSET_REG_OFST   _UINT32_(0x318)     /* (ADCHS_ADCDMASTATSET) Bit set register Offset */
#define ADCHS_ADCDMASTATINV_REG_OFST   _UINT32_(0x31C)     /* (ADCHS_ADCDMASTATINV) Bit invert register Offset */
#define ADCHS_ADCCNTB_REG_OFST         _UINT32_(0x320)     /* (ADCHS_ADCCNTB)  Offset */
#define ADCHS_ADCCNTBCLR_REG_OFST      _UINT32_(0x324)     /* (ADCHS_ADCCNTBCLR) Bit clear register Offset */
#define ADCHS_ADCCNTBSET_REG_OFST      _UINT32_(0x328)     /* (ADCHS_ADCCNTBSET) Bit set register Offset */
#define ADCHS_ADCCNTBINV_REG_OFST      _UINT32_(0x32C)     /* (ADCHS_ADCCNTBINV) Bit invert register Offset */
#define ADCHS_ADCDMAB_REG_OFST         _UINT32_(0x330)     /* (ADCHS_ADCDMAB)  Offset */
#define ADCHS_ADCDMABCLR_REG_OFST      _UINT32_(0x334)     /* (ADCHS_ADCDMABCLR) Bit clear register Offset */
#define ADCHS_ADCDMABSET_REG_OFST      _UINT32_(0x338)     /* (ADCHS_ADCDMABSET) Bit set register Offset */
#define ADCHS_ADCDMABINV_REG_OFST      _UINT32_(0x33C)     /* (ADCHS_ADCDMABINV) Bit invert register Offset */
#define ADCHS_ADCTRGSNS_REG_OFST       _UINT32_(0x340)     /* (ADCHS_ADCTRGSNS)  Offset */
#define ADCHS_ADCTRGSNSCLR_REG_OFST    _UINT32_(0x344)     /* (ADCHS_ADCTRGSNSCLR) Bit clear register Offset */
#define ADCHS_ADCTRGSNSSET_REG_OFST    _UINT32_(0x348)     /* (ADCHS_ADCTRGSNSSET) Bit set register Offset */
#define ADCHS_ADCTRGSNSINV_REG_OFST    _UINT32_(0x34C)     /* (ADCHS_ADCTRGSNSINV) Bit invert register Offset */
#define ADCHS_ADC0TIME_REG_OFST        _UINT32_(0x350)     /* (ADCHS_ADC0TIME) Dedicated High-Speed ADC Timing Register ('x' = 0) Offset */
#define ADCHS_ADC0TIMECLR_REG_OFST     _UINT32_(0x354)     /* (ADCHS_ADC0TIMECLR) Bit clear register Offset */
#define ADCHS_ADC0TIMESET_REG_OFST     _UINT32_(0x358)     /* (ADCHS_ADC0TIMESET) Bit set register Offset */
#define ADCHS_ADC0TIMEINV_REG_OFST     _UINT32_(0x35C)     /* (ADCHS_ADC0TIMEINV) Bit invert register Offset */
#define ADCHS_ADCEISTAT1CLR_REG_OFST   _UINT32_(0x3E4)     /* (ADCHS_ADCEISTAT1CLR) Bit clear register Offset */
#define ADCHS_ADCEISTAT1SET_REG_OFST   _UINT32_(0x3E8)     /* (ADCHS_ADCEISTAT1SET) Bit set register Offset */
#define ADCHS_ADCEISTAT1INV_REG_OFST   _UINT32_(0x3EC)     /* (ADCHS_ADCEISTAT1INV) Bit invert register Offset */
#define ADCHS_ADCANCON_REG_OFST        _UINT32_(0x400)     /* (ADCHS_ADCANCON)  Offset */
#define ADCHS_ADCANLCTLCLR_REG_OFST    _UINT32_(0x404)     /* (ADCHS_ADCANLCTLCLR) Bit clear register Offset */
#define ADCHS_ADCANLCTLSET_REG_OFST    _UINT32_(0x408)     /* (ADCHS_ADCANLCTLSET) Bit set register Offset */
#define ADCHS_ADCANLCTLINV_REG_OFST    _UINT32_(0x40C)     /* (ADCHS_ADCANLCTLINV) Bit invert register Offset */
#define ADCHS_ADC7CFG_REG_OFST         _UINT32_(0x670)     /* (ADCHS_ADC7CFG)  Offset */
#define ADCHS_ADCFGSHRCLR_REG_OFST     _UINT32_(0x674)     /* (ADCHS_ADCFGSHRCLR) Bit clear register Offset */
#define ADCHS_ADCFGSHRSET_REG_OFST     _UINT32_(0x678)     /* (ADCHS_ADCFGSHRSET) Bit set register Offset */
#define ADCHS_ADCFGSHRINV_REG_OFST     _UINT32_(0x67C)     /* (ADCHS_ADCFGSHRINV) Bit invert register Offset */
#define ADCHS_ADCSVCONCLR_REG_OFST     _UINT32_(0x684)     /* (ADCHS_ADCSVCONCLR) Bit clear register Offset */
#define ADCHS_ADCSVCONSET_REG_OFST     _UINT32_(0x688)     /* (ADCHS_ADCSVCONSET) Bit set register Offset */
#define ADCHS_ADCSVCONINV_REG_OFST     _UINT32_(0x68C)     /* (ADCHS_ADCSVCONINV) Bit invert register Offset */
#define ADCHS_ADCSYSCFG0_REG_OFST      _UINT32_(0x700)     /* (ADCHS_ADCSYSCFG0)  Offset */
#define ADCHS_ADCSYSCFG0CLR_REG_OFST   _UINT32_(0x704)     /* (ADCHS_ADCSYSCFG0CLR) Bit clear register Offset */
#define ADCHS_ADCSYSCFG0SET_REG_OFST   _UINT32_(0x708)     /* (ADCHS_ADCSYSCFG0SET) Bit set register Offset */
#define ADCHS_ADCSYSCFG0INV_REG_OFST   _UINT32_(0x70C)     /* (ADCHS_ADCSYSCFG0INV) Bit invert register Offset */
#define ADCHS_ADCDATA0_REG_OFST        _UINT32_(0xA00)     /* (ADCHS_ADCDATA0)  Offset */
#define ADCHS_ADCDATA1_REG_OFST        _UINT32_(0xA10)     /* (ADCHS_ADCDATA1)  Offset */
#define ADCHS_ADCDATA2_REG_OFST        _UINT32_(0xA20)     /* (ADCHS_ADCDATA2)  Offset */
#define ADCHS_ADCDATA3_REG_OFST        _UINT32_(0xA30)     /* (ADCHS_ADCDATA3)  Offset */
#define ADCHS_ADCDATA4_REG_OFST        _UINT32_(0xA40)     /* (ADCHS_ADCDATA4)  Offset */
#define ADCHS_ADCDATA5_REG_OFST        _UINT32_(0xA50)     /* (ADCHS_ADCDATA5)  Offset */
#define ADCHS_ADCDATA6_REG_OFST        _UINT32_(0xA60)     /* (ADCHS_ADCDATA6)  Offset */
#define ADCHS_ADCDATA7_REG_OFST        _UINT32_(0xA70)     /* (ADCHS_ADCDATA7)  Offset */
#define ADCHS_ADCDATA8_REG_OFST        _UINT32_(0xA80)     /* (ADCHS_ADCDATA8)  Offset */
#define ADCHS_ADCDATA9_REG_OFST        _UINT32_(0xA90)     /* (ADCHS_ADCDATA9)  Offset */
#define ADCHS_ADCDATA10_REG_OFST       _UINT32_(0xAA0)     /* (ADCHS_ADCDATA10)  Offset */
#define ADCHS_ADCDATA11_REG_OFST       _UINT32_(0xAB0)     /* (ADCHS_ADCDATA11)  Offset */
#define ADCHS_ADCDATA12_REG_OFST       _UINT32_(0xAC0)     /* (ADCHS_ADCDATA12)  Offset */
#define ADCHS_ADCDATA13_REG_OFST       _UINT32_(0xAD0)     /* (ADCHS_ADCDATA13)  Offset */
#define ADCHS_ADCDATA14_REG_OFST       _UINT32_(0xAE0)     /* (ADCHS_ADCDATA14)  Offset */
#define ADCHS_ADCDATA15_REG_OFST       _UINT32_(0xAF0)     /* (ADCHS_ADCDATA15)  Offset */
#define ADCHS_ADCDATA16_REG_OFST       _UINT32_(0xB00)     /* (ADCHS_ADCDATA16)  Offset */
#define ADCHS_ADCDATA17_REG_OFST       _UINT32_(0xB10)     /* (ADCHS_ADCDATA17)  Offset */
#define ADCHS_ADCDATA18_REG_OFST       _UINT32_(0xB20)     /* (ADCHS_ADCDATA18)  Offset */
#define ADCHS_ADCDATA19_REG_OFST       _UINT32_(0xB30)     /* (ADCHS_ADCDATA19)  Offset */
#define ADCHS_ADCDATA20_REG_OFST       _UINT32_(0xB40)     /* (ADCHS_ADCDATA20)  Offset */
#define ADCHS_ADCDATA21_REG_OFST       _UINT32_(0xB50)     /* (ADCHS_ADCDATA21)  Offset */
#define ADCHS_ADCDATA22_REG_OFST       _UINT32_(0xB60)     /* (ADCHS_ADCDATA22)  Offset */

