Microchip-MPLAB-Harmony/net_apps_pic32cxbz6_wbz6/apps/iperf_demo/src/packs/WBZ653_DFP/component/adchs.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief ADCHS register API structure */
typedef struct
{  /*  */
  __IO  uint32_t                       ADCHS_ADCCON1;      /**< Offset: 0x00 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCON1CLR;   /**< Offset: 0x04 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCON1SET;   /**< Offset: 0x08 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCON1INV;   /**< Offset: 0x0C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCCON2;      /**< Offset: 0x10 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCON2CLR;   /**< Offset: 0x14 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCON2SET;   /**< Offset: 0x18 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCON2INV;   /**< Offset: 0x1C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCCON3;      /**< Offset: 0x20 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCON3CLR;   /**< Offset: 0x24 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCON3SET;   /**< Offset: 0x28 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCON3INV;   /**< Offset: 0x2C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCTRGMODE;   /**< Offset: 0x30 (R/W  32) ADC Triggering Mode for Dedicated ADC Register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       ADCHS_ADCIMCON1;    /**< Offset: 0x40 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCIMOD1CLR;  /**< Offset: 0x44 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCIMOD1SET;  /**< Offset: 0x48 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCIMOD1INV;  /**< Offset: 0x4C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCIMCON2;    /**< Offset: 0x50 (R/W  32)  */
  __I   uint8_t                        Reserved2[0x2C];
  __IO  uint32_t                       ADCHS_ADCGIRQEN1;   /**< Offset: 0x80 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCGIRQEN1CLR; /**< Offset: 0x84 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCGIRQEN1SET; /**< Offset: 0x88 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCGIRQEN1INV; /**< Offset: 0x8C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved3[0x10];
  __IO  uint32_t                       ADCHS_ADCCSS1;      /**< Offset: 0xA0 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCSS1CLR;   /**< Offset: 0xA4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCSS1SET;   /**< Offset: 0xA8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCSS1INV;   /**< Offset: 0xAC (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved4[0x10];
  __IO  uint32_t                       ADCHS_ADCDSTAT1;    /**< Offset: 0xC0 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCDSTAT1CLR; /**< Offset: 0xC4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCDSTAT1SET; /**< Offset: 0xC8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCDSTAT1INV; /**< Offset: 0xCC (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved5[0x10];
  __IO  uint32_t                       ADCHS_ADCCMPEN1;    /**< Offset: 0xE0 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCMPEN0CLR; /**< Offset: 0xE4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCMPEN0SET; /**< Offset: 0xE8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCMPEN0INV; /**< Offset: 0xEC (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCCMP1;      /**< Offset: 0xF0 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCMP0CLR;   /**< Offset: 0xF4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCMP0SET;   /**< Offset: 0xF8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCMP0INV;   /**< Offset: 0xFC (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCCMPEN2;    /**< Offset: 0x100 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCMPEN1CLR; /**< Offset: 0x104 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCMPEN1SET; /**< Offset: 0x108 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCMPEN1INV; /**< Offset: 0x10C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCCMP2;      /**< Offset: 0x110 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADDCMP1CLR;   /**< Offset: 0x114 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADDCMP1SET;   /**< Offset: 0x118 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADDCMP1INV;   /**< Offset: 0x11C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved6[0x80];
  __IO  uint32_t                       ADCHS_ADCFLTR1;     /**< Offset: 0x1A0 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCFLTR0CLR;  /**< Offset: 0x1A4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCFLTR0SET;  /**< Offset: 0x1A8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCFLTR0INV;  /**< Offset: 0x1AC (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCFLTR2;     /**< Offset: 0x1B0 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCFLTR1CLR;  /**< Offset: 0x1B4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCFLTR1SET;  /**< Offset: 0x1B8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCFLTR1INV;  /**< Offset: 0x1BC (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved7[0x40];
  __IO  uint32_t                       ADCHS_ADCTRG1;      /**< Offset: 0x200 (R/W  32) ADC Trigger Source 1 Register */
  __IO  uint32_t                       ADCHS_ADCTRG1CLR;   /**< Offset: 0x204 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCTRG1SET;   /**< Offset: 0x208 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCTRG1INV;   /**< Offset: 0x20C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCTRG2;      /**< Offset: 0x210 (R/W  32) ADC Trigger Source 2 Register */
  __IO  uint32_t                       ADCHS_ADTRG2CLR;    /**< Offset: 0x214 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADTRG2SET;    /**< Offset: 0x218 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADTRG2INV;    /**< Offset: 0x21C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved8[0x04];
  __IO  uint32_t                       ADCHS_ADTRG3CLR;    /**< Offset: 0x224 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADTRG3SET;    /**< Offset: 0x228 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADTRG3INV;    /**< Offset: 0x22C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved9[0x50];
  __IO  uint32_t                       ADCHS_ADCCMPCON1;   /**< Offset: 0x280 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCMPCON1CLR; /**< Offset: 0x284 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCMPCON1SET; /**< Offset: 0x288 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCMPCON1INV; /**< Offset: 0x28C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCCMPCON2;   /**< Offset: 0x290 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCMPCON2CLR; /**< Offset: 0x294 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCMPCON2SET; /**< Offset: 0x298 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCMPCON2INV; /**< Offset: 0x29C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved10[0x44];
  __IO  uint32_t                       ADCHS_ADCFSTATCLR;  /**< Offset: 0x2E4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCFSTATSET;  /**< Offset: 0x2E8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCFSTATINV;  /**< Offset: 0x2EC (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved11[0x04];
  __IO  uint32_t                       ADCHS_ADCFIFOCLR;   /**< Offset: 0x2F4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCFIFOSET;   /**< Offset: 0x2F8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCFIFOINV;   /**< Offset: 0x2FC (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCBASE;      /**< Offset: 0x300 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCBASECLR;   /**< Offset: 0x304 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCBASESET;   /**< Offset: 0x308 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCBASEINV;   /**< Offset: 0x30C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCDMASTAT;   /**< Offset: 0x310 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCDMASTATCLR; /**< Offset: 0x314 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCDMASTATSET; /**< Offset: 0x318 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCDMASTATINV; /**< Offset: 0x31C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCCNTB;      /**< Offset: 0x320 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCCNTBCLR;   /**< Offset: 0x324 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCCNTBSET;   /**< Offset: 0x328 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCCNTBINV;   /**< Offset: 0x32C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCDMAB;      /**< Offset: 0x330 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCDMABCLR;   /**< Offset: 0x334 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCDMABSET;   /**< Offset: 0x338 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCDMABINV;   /**< Offset: 0x33C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADCTRGSNS;    /**< Offset: 0x340 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCTRGSNSCLR; /**< Offset: 0x344 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCTRGSNSSET; /**< Offset: 0x348 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCTRGSNSINV; /**< Offset: 0x34C (R/W  32) Bit invert register */
  __IO  uint32_t                       ADCHS_ADC0TIME;     /**< Offset: 0x350 (R/W  32) Dedicated High-Speed ADC Timing Register ('x' = 0) */
  __IO  uint32_t                       ADCHS_ADC0TIMECLR;  /**< Offset: 0x354 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADC0TIMESET;  /**< Offset: 0x358 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADC0TIMEINV;  /**< Offset: 0x35C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved12[0x84];
  __IO  uint32_t                       ADCHS_ADCEISTAT1CLR; /**< Offset: 0x3E4 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCEISTAT1SET; /**< Offset: 0x3E8 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCEISTAT1INV; /**< Offset: 0x3EC (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved13[0x10];
  __IO  uint32_t                       ADCHS_ADCANCON;     /**< Offset: 0x400 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCANLCTLCLR; /**< Offset: 0x404 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCANLCTLSET; /**< Offset: 0x408 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCANLCTLINV; /**< Offset: 0x40C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved14[0x260];
  __IO  uint32_t                       ADCHS_ADC7CFG;      /**< Offset: 0x670 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCFGSHRCLR;  /**< Offset: 0x674 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCFGSHRSET;  /**< Offset: 0x678 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCFGSHRINV;  /**< Offset: 0x67C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved15[0x04];
  __IO  uint32_t                       ADCHS_ADCSVCONCLR;  /**< Offset: 0x684 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCSVCONSET;  /**< Offset: 0x688 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCSVCONINV;  /**< Offset: 0x68C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved16[0x70];
  __IO  uint32_t                       ADCHS_ADCSYSCFG0;   /**< Offset: 0x700 (R/W  32)  */
  __IO  uint32_t                       ADCHS_ADCSYSCFG0CLR; /**< Offset: 0x704 (R/W  32) Bit clear register */
  __IO  uint32_t                       ADCHS_ADCSYSCFG0SET; /**< Offset: 0x708 (R/W  32) Bit set register */
  __IO  uint32_t                       ADCHS_ADCSYSCFG0INV; /**< Offset: 0x70C (R/W  32) Bit invert register */
  __I   uint8_t                        Reserved17[0x2F0];
  __I   uint32_t                       ADCHS_ADCDATA0;     /**< Offset: 0xA00 (R/   32)  */
  __I   uint8_t                        Reserved18[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA1;     /**< Offset: 0xA10 (R/   32)  */
  __I   uint8_t                        Reserved19[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA2;     /**< Offset: 0xA20 (R/   32)  */
  __I   uint8_t                        Reserved20[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA3;     /**< Offset: 0xA30 (R/   32)  */
  __I   uint8_t                        Reserved21[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA4;     /**< Offset: 0xA40 (R/   32)  */
  __I   uint8_t                        Reserved22[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA5;     /**< Offset: 0xA50 (R/   32)  */
  __I   uint8_t                        Reserved23[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA6;     /**< Offset: 0xA60 (R/   32)  */
  __I   uint8_t                        Reserved24[0x0C];
  __IO  uint32_t                       ADCHS_ADCDATA7;     /**< Offset: 0xA70 (R/W  32)  */
  __I   uint8_t                        Reserved25[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA8;     /**< Offset: 0xA80 (R/   32)  */
  __I   uint8_t                        Reserved26[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA9;     /**< Offset: 0xA90 (R/   32)  */
  __I   uint8_t                        Reserved27[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA10;    /**< Offset: 0xAA0 (R/   32)  */
  __I   uint8_t                        Reserved28[0x0C];
  __IO  uint32_t                       ADCHS_ADCDATA11;    /**< Offset: 0xAB0 (R/W  32)  */
  __I   uint8_t                        Reserved29[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA12;    /**< Offset: 0xAC0 (R/   32)  */
  __I   uint8_t                        Reserved30[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA13;    /**< Offset: 0xAD0 (R/   32)  */
  __I   uint8_t                        Reserved31[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA14;    /**< Offset: 0xAE0 (R/   32)  */
  __I   uint8_t                        Reserved32[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA15;    /**< Offset: 0xAF0 (R/   32)  */
  __I   uint8_t                        Reserved33[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA16;    /**< Offset: 0xB00 (R/   32)  */
  __I   uint8_t                        Reserved34[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA17;    /**< Offset: 0xB10 (R/   32)  */
  __I   uint8_t                        Reserved35[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA18;    /**< Offset: 0xB20 (R/   32)  */
  __I   uint8_t                        Reserved36[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA19;    /**< Offset: 0xB30 (R/   32)  */
  __I   uint8_t                        Reserved37[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA20;    /**< Offset: 0xB40 (R/   32)  */
  __I   uint8_t                        Reserved38[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA21;    /**< Offset: 0xB50 (R/   32)  */
  __I   uint8_t                        Reserved39[0x0C];
  __I   uint32_t                       ADCHS_ADCDATA22;    /**< Offset: 0xB60 (R/   32)  */
} adchs_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _WBZ65_ADCHS_COMPONENT_H_ */
